org/2021-37.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021 年第 37 周总结
#+DATE: <2021-09-12 Sun>
#+HUGO_TAGS: 总结
阶段计划：

- [[https://github.com/tianheg/blog/issues/142][面试前端+个人技能]]
- [[https://www.freecodecamp.org/learn/javascript-algorithms-and-data-structures/]]

本周计划：

- 技术

  - 读《图解 HTTP》2,3 章

- 放松

  - 看《阳光普照》

- 专业作业：

  - 生产实习（日记+报告）

- 博客：

  - 《脱发和什么有关》

周一：

- 从家到学校

周二：

- [X] 图解 HTTP 2.3-2.6
- [X] 备份的 321 法则
  [[https://www.backblaze.com/blog/back-to-school-backup-for-school/]]
- [X] 为博客添加 discussion 评论

周三：

- [X] css(Custom checkbox)

周五：

- [X] Get Responsive Web Design Certification(@freeCodeCamp)
- [X] css(border)
- [X] 图解 HTTP(使用 Cookie 的状态管理)
- [X] 数据结构与算法之美-极客时间(复杂度分析)

周六：

- [X] CSS(盒子模型)

周日：

- [X] 生产实习日记
