blog/2021/2021-37.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-08 Tue 19:01 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 37 周总结</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 37 周总结</h1>
</header><p>
阶段计划：
</p>

<ul class="org-ul">
<li><a href="https://github.com/tianheg/blog/issues/142">面试前端+个人技能</a></li>
<li><a href="https://www.freecodecamp.org/learn/javascript-algorithms-and-data-structures/">https://www.freecodecamp.org/learn/javascript-algorithms-and-data-structures/</a></li>
</ul>

<p>
本周计划：
</p>

<ul class="org-ul">
<li>技术

<ul class="org-ul">
<li>读《图解 HTTP》2,3 章</li>
</ul></li>

<li>放松

<ul class="org-ul">
<li>看《阳光普照》</li>
</ul></li>

<li>专业作业：

<ul class="org-ul">
<li>生产实习（日记+报告）</li>
</ul></li>

<li>博客：

<ul class="org-ul">
<li>《脱发和什么有关》</li>
</ul></li>
</ul>

<p>
周一：
</p>

<ul class="org-ul">
<li>从家到学校</li>
</ul>

<p>
周二：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 图解 HTTP 2.3-2.6</li>
<li class="on"><code>[X]</code> 备份的 321 法则
<a href="https://www.backblaze.com/blog/back-to-school-backup-for-school/">https://www.backblaze.com/blog/back-to-school-backup-for-school/</a></li>
<li class="on"><code>[X]</code> 为博客添加 discussion 评论</li>
</ul>

<p>
周三：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> css(Custom checkbox)</li>
</ul>

<p>
周五：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Get Responsive Web Design Certification(@freeCodeCamp)</li>
<li class="on"><code>[X]</code> css(border)</li>
<li class="on"><code>[X]</code> 图解 HTTP(使用 Cookie 的状态管理)</li>
<li class="on"><code>[X]</code> 数据结构与算法之美-极客时间(复杂度分析)</li>
</ul>

<p>
周六：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> CSS(盒子模型)</li>
</ul>

<p>
周日：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 生产实习日记</li>
</ul>
</div>
</body>
</html>